/*
 * This is a "Manager" for the Nortel Millennium payhone.
 *
 * It can provision a Nortel Millennium payphone with Rev 1.0 or 1.3
 * Control PCP.  CDRs, Alarms, and Maintenance Reports can also be
 * retieved.
 *
 * www.github.com/hharte/mm_manager
 *
 * (c) 2020, Howard M. Harte
 */

#define RX 2
#define TX 3

#define START_BYTE      (0x02)
#define STOP_BYTE       (0x03)

#define FLAG_DISCONNECT (1 << 5)
#define FLAG_ACK        (1 << 3)
#define FLAG_RETRY      (1 << 2)
#define FLAG_SEQUENCE   (0x3)

#define PKT_SUCCESS                 (0)
#define PKT_ERROR_RETRY             (1 << 0)
#define PKT_ERROR_DISCONNECT        (1 << 1)
#define PKT_ERROR_CRC               (1 << 2)
#define PKT_ERROR_FRAMING           (1 << 3)
#define PKT_ERROR_TIMEOUT           (1 << 4)
#define PKT_ERROR_EOF               (1 << 5)

#define PKT_TIMEOUT_MAX             (10)    // Maximum time  to wait for modem character

#define PKT_TABLE_ID_OFFSET         (0x05)
#define PKT_TABLE_DATA_OFFSET       (PKT_TABLE_ID_OFFSET + 1)

#define PKT_TABLE_DATA_LEN_MAX      (245)   // Maximum table data length

/* TERMSCH (Terminal Schedule) pp. 2-533
 * Renamed per https://wiki.millennium.management/dlog:start
 */
#define DLOG_MT_CARD_AUTH_REQ       0x01    // 1: Card Authorization Request
#define DLOG_MT_FUNF_CARD_AUTH      0x02    // 2: Formatted/Unformatted Authorization Request – Post MSR 1.5 message.
#define DLOG_MT_AUTH_RESPONSE       0x03    // 3: Authorization Response

#define DLOG_MT_VIS_PROPTS_L1       0x55    // 85: Expanded Visual Prompts Language A
#define DLOG_MT_VIS_PROPTS_L2       0x56    // 86: Expanded Visual Prompts Language B
#define DLOG_MT_CALL_SCREEN_LIST    0x5c    // 92B: 180 Number Call Screening List
#define DLOG_MT_SCARD_PARM_TABLE    0x5d    // 93: Smart Card Parameters Table
#define DLOG_MT_CARD_TABLE          0x86    // 134: Expanded Card Table (32 Entries)
#define DLOG_MT_CARRIER_TABLE       0x87    // 135: Expanded Carrier Table (33 Entries)
#define DLOG_MT_NPA_NXX_TABLE_1     0x88    // 136: Double Compressed LCD Table 1
#define DLOG_MT_NPA_NXX_TABLE_2     0x89    // 137: Double Compressed LCD Table 2
#define DLOG_MT_NPA_NXX_TABLE_3     0x8a    // 138: Double Compressed LCD Table 3
#define DLOG_MT_NPA_NXX_TABLE_4     0x8b    // 139: Double Compressed LCD Table 4
#define DLOG_MT_NPA_NXX_TABLE_5     0x8c    // 140: Double Compressed LCD Table 5
#define DLOG_MT_NPA_NXX_TABLE_6     0x8d    // 141: Double Compressed LCD Table 6
#define DLOG_MT_NPA_NXX_TABLE_7     0x8e    // 142: Double Compressed LCD Table 7
#define DLOG_MT_NPA_NXX_TABLE_8     0x8f    // 143: Double Compressed LCD Table 8
#define DLOG_MT_NPA_NXX_TABLE_9     0x90    // 144: Double Compressed LCD Table 9
#define DLOG_MT_NPA_NXX_TABLE_10    0x91    // 145: Double Compressed LCD Table 10
#define DLOG_MT_NPA_NXX_TABLE_11    0x92    // 146: Double Compressed LCD Table 11
#define DLOG_MT_NPA_NXX_TABLE_12    0x93    // 147: Double Compressed LCD Table 12
#define DLOG_MT_NPA_NXX_TABLE_13    0x94    // 148: Double Compressed LCD Table 13
#define DLOG_MT_NPA_NXX_TABLE_14    0x95    // 149: Double Compressed LCD Table 14
#define DLOG_MT_NPA_NXX_TABLE_15    0xa0    // 154: Double Compressed LCD Table 15
#define DLOG_MT_NPA_NXX_TABLE_16    0xa1    // 155: Double Compressed LCD Table 16
#define DLOG_MT_NPA_SBR_TABLE       0x96    // 150: Set Based Rating NPA Table
#define DLOG_MT_INTL_SBR_TABLE      0x97    // 151: Set Based Rating International Table

/* TTBLREQ (Terminal Table Request) pp. 2-651 */
#define TTBLREQ_CRAFT_FORCE_DL      0x01    // Menu Item - Craft I/F Table Download
#define TTBLREQ_CRAFT_INSTALL       0x02    // Install via Craft I/F
#define TTBLREQ_LOST_MEMORY         0x04    // Lost Memory
#define TTBLREQ_PWR_LOST_ON_DL      0x08    // Power Lost on Download
#define TTBLREQ_CASHBOX_STATUS      0x80    // Cash Box Status Requested

/* TCOLLCT (Terminal Cash Box Collections) pp. 2-464 */
#define CASHBOX_STATUS_NORMAL           0x00    // Normal State
#define CASHBOX_STATUS_VALUE_EXCEEDED   0x01    // Dollar Value exceeded
#define CASHBOX_STATUS_THRESH_EXCEEDED  0x02    // Percent Threshold exceeded
#define CASHBOX_STATUS_BOTH_EXCEEDED    0x03    // Both dollar value and percent threshold exceeded
#define CASHBOX_STATUS_FULL             0x04    // Cashbox totally full

#pragma pack(push)
#pragma pack(1)         /* Pack data structures for communication with terminal. */

/* Structure of the Millennium Manager Packet Header */
typedef struct mm_packet_header {
    uint8_t start;      /* Start byte (0x02) */
    uint8_t flags;      /* Flags and sequence number */
    uint8_t pktlen;     /* Packet length, from flags to end byte. */
} mm_packet_header_t;

typedef struct mm_packet_trailer {
    uint16_t crc;       /* CRC-16 including start byte through payload. */
    uint8_t end;        /* End byte (0x03) */
} mm_packet_trailer_t;

typedef struct mm_packet {
    mm_packet_header_t  hdr;        /* MM packet header */
    uint8_t payload[250];           /* Data payload */
    mm_packet_trailer_t trailer;    /* MM packet trailer */
    uint8_t payload_len;            /* Metadata not part of actual packet on the wire. */
    uint16_t calculated_crc;        /* Metadata not part of actual packet on the wire. */
} mm_packet_t;

typedef struct mm_table {
    uint8_t table_id;
    uint8_t data[10 * 1024];
    mm_packet_t pkt;
} mm_table_t;

/*
 * These data structures match the ones generated and
 * consumed by the terminal.
 */
typedef struct dlog_mt_alarm {
    uint8_t timestamp[6];
    uint8_t alarm_id;
} dlog_mt_alarm_t;

typedef struct dlog_mt_maint_req {
    uint16_t type;
    uint8_t access_pin[3];
} dlog_mt_maint_req_t;

typedef struct dlog_mt_call_back_req {
    uint16_t type;
    uint8_t callback_time[6];
} dlog_mt_call_back_req_t;

typedef struct dlog_mt_ncc_term_params {
    uint8_t terminal_id[5];
    uint8_t pri_ncc_number[10];
    uint8_t sec_ncc_number[10];
    uint8_t unknown[22];
} dlog_mt_ncc_term_params_t;

/* From TERM table, pp. 2-517 */
typedef struct dlog_mt_call_in_params {
    uint8_t call_in_start_date[3];      /* Call-in start date YY:MM:DD */
    uint8_t call_in_start_time[3];      /* Call-in start date HH:MM:SS */
    uint8_t call_in_interval[3];        /* Call-in inteval DD:HH:MM */
    uint8_t call_back_retry_time[2];    /* Call-back retry time MM:SS */
    uint8_t cdr_threshold;              /* Indicates the number of CDRs that the terminal will store before automatically calling in to the Millennium Manager to upload them. (Range: 1-50) */
    uint8_t unknown_timestamp[6];       /* Looks like a timestamp, but not sure what it's for. */
    uint8_t unknown[2];
} dlog_mt_call_in_params_t;

/* From CALLST (Call Statistics Parameters) pp. 2-36 */
typedef struct dlog_mt_call_stat_params {
    uint8_t callstats_start_time[2];    /* Call stats start date HH:MM */
    uint8_t callstats_duration;         /* Indicates the number of days over which call statistics will be accumulated. */
    uint8_t callstats_threshold;        /* Indicates the number of Call Statistics records that the terminal will store before automatically calling in to the Millennium Manager to upload them. */
    uint8_t timestamp[4][2];            /* These timestamps, entered in the terminal's local time, are used with the Call Statistics Start Time to partition the 24-hour recording period into as many as 5 time periods. */
    uint8_t enable;                     /* 0=No (Disabled), 1=Yes (Enabled), 2=Summarized Carrier Statistics */
    uint8_t cdr_threshold;              /* Indicates the number of Full CDR Logging records that the terminal will store before automatically calling in to the Millennium Manager to upload them. */
    uint8_t cdr_start_time[2];          /* HH:MM Indicates the time of day the terminal should begin full CDR logging, in the terminal local time. */
    uint8_t cdr_duration_days;          /* Indicates the number of days over which to perform Full CDR Logging. */
    uint8_t cdr_duration_hours_flags;   /* 0-23, Bit 6: Indicates whether statistics should be recorded for all complete calls except local coin. */
} dlog_mt_call_stat_params_t;

/* From COMMST (Communications Statistics Parameters) pp. 2-86 */
typedef struct dlog_mt_comm_stat_params {
    uint16_t co_access_dial_complete;       /* 100 */
    uint16_t co_access_dial_complete_int;   /* 50 */
    uint16_t dial_complete_carr_detect;     /* 100 */
    uint16_t dial_complete_carr_detect_int; /* 50 */
    uint16_t pad[2];
    uint16_t carr_detect_first_pac;         /* 10 */
    uint16_t carr_detect_first_pac_int;     /* 5 */
    uint16_t user_waiting_expect_info;      /* 600 */
    uint16_t user_waiting_expect_info_int;  /* 100 */
    uint8_t perfstats_threshold;            /* 2 Indicates the number of Perf Statistics records that the terminal will store before automatically calling in to the Millennium Manager to upload them. */
    uint8_t perfstats_start_time[2];        /* Perf stats start date HH:MM */
    uint8_t perfstats_duration;             /* Indicates the number of days over which Perf statistics will be accumulated. */
    uint8_t perfstats_timestamp[4][2];      /* These timestamps, entered in the terminal's local time, are used with the Perf Statistics Start Time to partition the 24-hour recording period into as many as 5 time periods. */
} dlog_mt_comm_stat_params_t;

/* From USERPRM (User Interface Parameters) pp. 2-670 */
typedef struct dlog_mt_user_if_params {
    uint16_t digit_clear_delay;             /* 450 */
    uint16_t transient_delay;               /* 450 */
    uint16_t transient_hint_time;           /* 450 */
    uint16_t visual_to_voice_delay;         /* 450 */
    uint16_t voice_repitition_delay;        /* 450 */
    uint16_t no_action_timeout;             /* 3000 (30s) */
    uint16_t card_validation_timeout;       /* 3000 (30s) */
    uint16_t dj_second_string_dtmf_timeout; /* 300 (3s) */
    uint16_t spare_timer_b;                 /* 1100 (11s) */
    uint16_t cp_input_timeout;              /* 100 (1s) */
    uint16_t language_timeout;              /* 1000 (10s) */
    uint16_t cfs_timeout;                   /* 200 (2s) */
    uint16_t called_party_disconnect;       /* 1200 (12s) */
    uint8_t  no_voice_prompt_reps;          /* 3 */
    uint16_t accs_digit_timeout;            /* 450 (4.5s) */
    uint16_t collect_call_timeout;          /* 400 (4s) */
    uint16_t bong_tone_timeout;             /* 1600 (16s) */
    uint16_t accs_no_action_timeout;        /* 450 (4.5s) */
    uint16_t card_auth_required_timeout;    /* 6000 (60s) */
    uint16_t rate_request_timeout;          /* 6000 (60s) */
